In [ ]:
import pandas as pd
import numpy as np
data=pd.read_excel("/titanic (1).xls")
data.head()

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

10세 이하 사망자

In [ ]:
is_child=data['age']<=10
is_dead=data['survived']==0
deadChild=data[is_child&is_dead]
len(deadChild)

36

60세 이상 사망자

In [ ]:
data[data['age']>=60].groupby('survived').size()[0]

28

남성 사망자

In [ ]:
is_male=data['sex']=='male'
is_dead=data['survived']==0
deadMan=data[is_male&is_dead]
len(deadMan)

682

In [ ]:
60세 이상의 여성 사망자

In [ ]:
data[(data['age']>=60)&(data['sex']=='female')].groupby('survived').size()[0]

2

isna(),fillna() 등으로 NaN값들을 적절한 값으로 채우기

In [ ]:
data.where(data.isna()==False,'undefined')

      pclass  survived  ...       body                        home.dest
0          1         1  ...  undefined                     St Louis, MO
1          1         1  ...  undefined  Montreal, PQ / Chesterville, ON
2          1         0  ...  undefined  Montreal, PQ / Chesterville, ON
3          1         0  ...        135  Montreal, PQ / Chesterville, ON
4          1         0  ...  undefined  Montreal, PQ / Chesterville, ON
...      ...       ...  ...        ...                              ...
1304       3         0  ...        328                        undefined
1305       3         0  ...  undefined                        undefined
1306       3         0  ...        304                        undefined
1307       3         0  ...  undefined                        undefined
1308       3         0  ...  undefined                        undefined

[1309 rows x 14 columns]